multipleLayeringFvMesh/run/cube4Parallel/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     scalarTransportDyMFoamMC;

startFrom       startTime; //latestTime; //startTime;

startTime       0;

stopAt          endTime;

endTime         5;

deltaT          0.005;

writeControl    timeStep;

writeInterval   2; //1;

cycleWrite      0;

writeFormat     ascii;

writeCompression uncompressed;

timeFormat      general;

runTimeModifiable yes;

adjustTimeStep   no;

maxCo            0.5;

/*libs
(
    "libdynamicMeshMC.so"
);*/
// ************************************************************************* //
