multipleLayeringFvMesh/run/cube4Parallel/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

    {
        name    pistonTop;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name   top;
        }
    }
    
    {
        name    pistonRight;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name   right;
        }
    }

///////////////////////////////////////////////////////////////////////////

   
);

// ************************************************************************* //
